In [1]:
import env
import wrangle_zillow as wrangle
import numpy as np
import pandas as pd

In [2]:
zillow = pd.read_csv('zillow.csv')

In [3]:
wrangle.summarize(zillow)

SUMMARY REPORT
=====================================================


Dataframe head:
   bedrooms  bathrooms  area  tax_value  year_built    fips
0      0.00       0.00   NaN   27516.00         NaN 6037.00
1      0.00       0.00   NaN      10.00         NaN 6037.00
2      0.00       0.00   NaN      10.00         NaN 6037.00
=====================================================


Dataframe info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152864 entries, 0 to 2152863
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   bedrooms    float64
 1   bathrooms   float64
 2   area        float64
 3   tax_value   float64
 4   year_built  float64
 5   fips        float64
dtypes: float64(6)
memory usage: 98.6 MB
None
=====================================================


Dataframe Description:
        bedrooms  bathrooms       area   tax_value  year_built       fips
count 2152853.00 2152853.00 2144379.00  2152371.00  2143526.00 2152864.00
mean        3.29       2.23    1862.86   461896.05     1960.95    6048.38
std         0.95       1.00    1222.13   699675.94       22.16      20.43
min         0.00       0.00       1.00        1.00     1801.00    6037.00
25%         3.00       2.00    1257.00   188170.00     1949.00    6037.00
50%         3.00       2.00    1623.00   327671.00     1958.00    6037.00
75%         4.00       3.00    2208.00   534527.00     1976.00    6059.00
max        25.00      32.00  952576.00 98428909.00     2016.00    6111.00
=====================================================
DataFrame value counts:
(-0.026000000000000002, 2.5]     371827
(2.5, 5.0]                      1749453
(5.0, 7.5]                        29973
(7.5, 10.0]                        1519
(10.0, 12.5]                         46
(12.5, 15.0]                         29
(15.0, 17.5]                          2
(17.5, 20.0]                          3
(20.0, 22.5]                          0
(22.5, 25.0]                          1
Name: bedrooms, dtype: int64

(-0.033, 3.2]    1967993
(3.2, 6.4]        175505
(6.4, 9.6]          8676
(9.6, 12.8]          564
(12.8, 16.0]          94
(16.0, 19.2]          13
(19.2, 22.4]           7
(22.4, 25.6]           0
(25.6, 28.8]           0
(28.8, 32.0]           1
Name: bathrooms, dtype: int64

(-951.576, 95258.5]     2144377
(95258.5, 190516.0]           0
(190516.0, 285773.5]          0
(285773.5, 381031.0]          0
(381031.0, 476288.5]          0
(476288.5, 571546.0]          1
(571546.0, 666803.5]          0
(666803.5, 762061.0]          0
(762061.0, 857318.5]          0
(857318.5, 952576.0]          1
Name: area, dtype: int64

(-98427.909, 9842891.8]     2151018
(9842891.8, 19685782.6]        1102
(19685782.6, 29528673.4]        173
(29528673.4, 39371564.2]         44
(39371564.2, 49214455.0]         15
(49214455.0, 59057345.8]          8
(59057345.8, 68900236.6]          5
(68900236.6, 78743127.4]          2
(78743127.4, 88586018.2]          2
(88586018.2, 98428909.0]          2
Name: tax_value, dtype: int64

(1800.784, 1822.5]         6
(1822.5, 1844.0]           3
(1844.0, 1865.5]           4
(1865.5, 1887.0]         374
(1887.0, 1908.5]       17648
(1908.5, 1930.0]      202220
(1930.0, 1951.5]      454131
(1951.5, 1973.0]      899067
(1973.0, 1994.5]      379614
(1994.5, 2016.0]      190459
Name: year_built, dtype: int64

(6036.925, 6044.4]    1431812
(6044.4, 6051.8]            0
(6051.8, 6059.2]       555077
(6059.2, 6066.6]            0
(6066.6, 6074.0]            0
(6074.0, 6081.4]            0
(6081.4, 6088.8]            0
(6088.8, 6096.2]            0
(6096.2, 6103.6]            0
(6103.6, 6111.0]       165975
Name: fips, dtype: int64

=====================================================
nulls in dataframe by column:
            num_rows_missing  percent_rows_missing
year_built              9338                  0.43
area                    8485                  0.39
tax_value                493                  0.02
bedrooms                  11                  0.00
bathrooms                 11                  0.00
fips                       0                  0.00
=====================================================
nulls in dataframe by row:
         num_cols_missing  percent_cols_missing
1442976                 4                 66.67
1776423                 4                 66.67
1722708                 4                 66.67
1733378                 3                 50.00
1701027                 3                 50.00
...                   ...                   ...
719292                  0                  0.00
719291                  0                  0.00
719290                  0                  0.00
719289                  0                  0.00
2152863                 0                  0.00

[2152864 rows x 2 columns]
=====================================================

In [4]:
wrangle.missing_value_summary(zillow)

            Num Missing  Percent Missing
year_built         9338             0.43
area               8485             0.39
tax_value           493             0.02
bedrooms             11             0.00
bathrooms            11             0.00
fips                  0             0.00

In [5]:
wrangle.handle_missing_values(zillow)

         bedrooms  bathrooms    area  tax_value  year_built    fips
0            0.00       0.00     NaN   27516.00         NaN 6037.00
1            0.00       0.00     NaN      10.00         NaN 6037.00
2            0.00       0.00     NaN      10.00         NaN 6037.00
3            0.00       0.00     NaN    2108.00         NaN 6037.00
4            4.00       2.00 3633.00  296425.00     2005.00 6037.00
...           ...        ...     ...        ...         ...     ...
2152859      4.00       3.00 2262.00  960756.00     2015.00 6059.00
2152860      4.00       4.50 3127.00  536061.00     2014.00 6059.00
2152861      0.00       0.00     NaN  208057.00         NaN 6059.00
2152862      3.00       2.50 1974.00  424353.00     2015.00 6059.00
2152863      4.00       4.00 2110.00  554009.00     2014.00 6037.00

[2152483 rows x 6 columns]